# DimensionReferencesInvalid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..DimensionReferencesInvalid Property
BuiltInFailures..::..DimensionFailures Class See Also
---
One or more dimension references are or have become invalid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DimensionReferencesInvalid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimensionReferencesInvalid As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DimensionReferencesInvalid {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace